# Задача 5
# Зарплата сотрудника составляет salary руб., 
# Расходы на проживание превышают зараплату и составляют expenses руб. в месяц. 
# Рост цен ежемесячно увеличивает расходы на 3%, кроме первого месяца
# Напишите скрипт расчета суммы денег, которую необходимо взять в долг, 
# чтобы можно было прожить ближайший год (12 месяцев).
# Формат вывода:
# Необходимо взять в долг ХХХ.ХХ рублей

salary, expenses = 10000, 12000

def loan_calculator(salary, expences):
    debt = expences - salary
    
    for i in range(11):
        expences *= 1.03
        debt += expences - salary

    
    return f'Необходимо взять в долг {round(debt, 2)} рублей'

print(loan_calculator(salary, expenses))

# Отлично
